Revit 2026 API

# ConnectorElementShape Property

---

The shape of the connector.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public virtual ConnectorProfileType Shape { get; }
```
```vb
Public Overridable ReadOnly Property Shape As ConnectorProfileType
	Get
```
```cpp
public:
virtual property ConnectorProfileType Shape {
	ConnectorProfileType get ();
}
```
```fsharp
abstract Shape : ConnectorProfileType with get
override Shape : ConnectorProfileType with get
```

#### Property Value

ConnectorProfileType

#### Implements

IConnectorShape

ConnectorProfileType::Invalid if the connector is electrical or undefined.

#### Reference

ConnectorElement Class

Autodesk.Revit.DB Namespace